In [1]:
# import des modules :
import pandas as pd
import numpy as np

In [ ]:
# import des modules :
import pandas as pd
import numpy as np

#Récupération de la BD :
link4 = "./BD/title.crew.tsv.gz"
df_t_crew = pd.read_csv(link4, sep = "\t", compression = "gzip")

# Création d'une copie :
df_t_crew_Clean = df_t_crew.copy()

# Netoyage des données:
valNull = df_t_crew_Clean.isna().sum() #0 valeurs
duplicated = df_t_crew_Clean.duplicated().sum()  # 0valeurs mais y a \N à traiter

# Etape 1 : Spliter les listes:
df_t_crew_Clean['directors'] = df_t_crew_Clean['directors'].apply(lambda x: x.strip().split(',') if isinstance(x,str) else x )
df_t_crew_Clean['writers'] = df_t_crew_Clean['writers'].apply(lambda x: x.strip().split(',') if isinstance(x,str) else x)

#Etape 2 : Transformation des valeurs \N en NAN
df_t_crew_Clean['directors'] = df_t_crew_Clean['directors'].replace(r'\N', np.nan)
df_t_crew_Clean['writers'] = df_t_crew_Clean['writers'].replace(r'\N', np.nan)


# Etape3 : exploser (dans un second temps) ===> à réaliser
df_t_crew_Clean = df_t_crew_Clean.explode('directors')
df_t_crew_Clean = df_t_crew_Clean.explode('writers')

In [3]:
#les Bases de données : 

link4 = "./BD/title.crew.tsv.gz"
df_t_crew = pd.read_csv(link4, sep = "\t", compression = "gzip")

In [4]:
df_t_crew_Clean = df_t_crew.copy()

In [46]:
df_t_crew_Clean.sample(10)

             tconst   directors              writers
4584112  tt18481864  nm11138475                   \N
1139087  tt10309314          \N                   \N
7698294  tt33808733   nm2351889                   \N
9122290   tt6494082   nm3308068            nm3308068
2643079  tt13161464          \N                   \N
8499354   tt5036578   nm6501104            nm6501104
5577728  tt23264794          \N                   \N
438875    tt0452583   nm0171315  nm2091193,nm1885615
535947    tt0551464   nm0739298            nm0739298
9435065   tt7235518   nm3289740  nm1820958,nm3279685

In [34]:
valNull = df_t_crew_Clean.isna().sum()
duplicated = df_t_crew_Clean.duplicated().sum()

print(f'les valeurs null sont : \n {valNull}'), print(f'les valeurs duppliqués sont : {duplicated}')

# pas de lignes duppliquée. par contre dnas le tableaux les valeurs null sont exprimés en\N

les valeurs null sont :
 tconst       0
directors    0
writers      0
dtype: int64
les valeurs duppliqués sont : 0

(None, None)

In [ ]:
df_t_crew_Clean[df_t_crew_Clean['tconst'] =='\\N']

Empty DataFrame
Columns: [tconst, directors, writers]
Index: []

In [ ]:
df_t_crew_Clean[df_t_crew_Clean['directors'] =='\\N']

             tconst directors    writers
38        tt0000039        \N         \N
103       tt0000104        \N         \N
124       tt0000125        \N         \N
174       tt0000176        \N         \N
197       tt0000199        \N         \N
...             ...       ...        ...
10600573  tt9916738        \N  nm0665704
10600574  tt9916740        \N         \N
10600575  tt9916742        \N         \N
10600586  tt9916766        \N         \N
10600591  tt9916778        \N         \N

[4047951 rows x 3 columns]

In [ ]:
df_t_crew_Clean[df_t_crew_Clean['writers'] =='\\N']

Empty DataFrame
Columns: [tconst, directors, writers]
Index: []

In [5]:
#Etape 1 : transformer les valeurs en liste : 
df_t_crew_Clean['directors'] = df_t_crew_Clean['directors'].apply(lambda x: x.strip().split(',') if isinstance(x,str) else x )
df_t_crew_Clean['writers'] = df_t_crew_Clean['writers'].apply(lambda x: x.strip().split(',') if isinstance(x,str) else x)

In [6]:
#Etape 2 : transformer le \N en NaN ==> deux méthode (méthode 1 voir t_basics , méthode 2 (JP) voir ci-dessous)
df_t_crew_Clean['directors'] = df_t_crew_Clean['directors'].replace(r'\N', np.nan)
df_t_crew_Clean['writers'] = df_t_crew_Clean['writers'].replace(r'\N', np.nan)

In [ ]:
# Etape 3 (en second temps): eclater la liste en plusieurs lignes, PS je constate que cela s'applique uniquement sur une des colonnes ici c'est le dernier code Writers, 
# ==> attribuer la valeur dans DF pour pouvoir exécuter les deux explode()
df_t_crew_Clean = df_t_crew_Clean.explode('directors')
df_t_crew_Clean = df_t_crew_Clean.explode('writers')

In [7]:
df_t_crew_Clean.isna().sum()

tconst       0
directors    0
writers      0
dtype: int64

In [49]:
df_t_crew_Clean.isna().sum()

tconst             0
directors    4047951
writers      4708765
dtype: int64

In [52]:
df_t_crew_Clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10600630 entries, 0 to 10600629
Data columns (total 3 columns):
 #   Column     Dtype
---  ------     -----
 0   tconst     object
 1   directors  object
 2   writers    object
dtypes: object(3)
memory usage: 242.6+ MB

In [54]:
df_t_crew_Clean.to_csv('df_t_crew_clean.csv', index = False)